"use strict";

// многомерные массивы

// let arr = [['a', 'b', 'c'], ['d', 'e', 'f'], ['g', 'h', 'i']];

// многомерные массиивы не удобно 'читать' в виде строки, поэтому оформим в более удобной форме представления
// двумерный массив
let arr = [
    ['a', 'b', 'c'],
    ['d', 'e', 'f'],
    ['g', 'h', 'i']
];

// выведем 'b'
console.log(arr[0][1]); // b

// выведем 'f'
console.log(arr[1][2]); // f

//____________________________________________________________________________
// массив произвольного уровня вложенности
let arr_2 = [
  [
      'a', 'b', [1, 2, 3], [4, 5],
  ],
  [
      'd', ['e', 'f'],
  ]
];

// создадим функцию, в которою параметром будем передавать  массив,
// а в функции сделаем цикл для перебора нашего массива

function func(arr){
    for (let elem of arr){
        console.log(elem);
    }
}

let arr_test = [
    1,
    [2, 7, 8],
    [
        3,
        4,
        [
            5,
            [6, 7]
        ]
    ]
]

func(arr_test);
/*
    script2.js:37                1
    script2.js:37               [2, 7, 8]
    script2.js:37               3, 4, Array(2)]
 */

// Теперь мы будем разделять в цикле элементы - примитивы и элементы массивы

function func_v2(arr){
    for (let elem of arr){
        if (typeof elem == 'object'){
            // элемент - массив
        } else {
            // элемент - примитив
            console.log(elem)
        }
    }
}

func_v2(arr_test); // 1     script2.js:69 1

/* Модифицируем функцию func_v2, таким образом, что:
   Если наш элемент массив, функция func_v2 вызывает сама себя, при этом передавая параметром массив

 */

function func_v3(arr){
    for (let elem of arr){
        if (typeof elem == 'object'){
            func_v3(elem);
            /*
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            !!!!!!!!!!!!!!!!!!!!!!!РЕКУРСИЯ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
             */
        } else {
            console.log(elem);
        }
    }
}

console.log(func_v3(arr_test));

/*
script2.js:86 1
script2.js:86 2
script2.js:86 7
script2.js:86 8
script2.js:86 3
script2.js:86 4
script2.js:86 5
script2.js:86 6
script2.js:86 7
 */



// найдем сумму элементов массива произвольного уровня вложенности
function arr_sum(arr){
    let sum = 0; // счетчик

    for (let elem of arr){
        if (typeof elem == 'object'){
            sum += arr_sum(elem); // sum = sum + arr_sum(elem)
        } else {
            sum += elem;
        }
    }


    return sum;
}

console.log(arr_sum(arr_test)); // 43 script2.js:130



